#include <stdio.h>

/*
整数的二进制表示有三种
原码
反码
补码

正整数的原码、反码、补码相同
负整数的原码、反码、补码需要计算

7
00000000 00000000 00000000 00000111 - 原码
00000000 00000000 00000000 00000111 - 反码
00000000 00000000 00000000 00000111 - 补码


-7
10000000 00000000 00000000 00000111 - 原码
11111111 11111111 11111111 11111000 - 反码（原码符号位不变，其它位按位取反）
11111111 11111111 11111111 11111001 - 补码（反码+1）

整数在内存中存的是补码
右移运算符
算数右移：右边丢弃左边补原符号位（vs采用算数右移）
逻辑右移：右边丢弃左边补0
*/
//int main()
//{
//	int a = 7;
//	//移位运算符移动的是二进制位，补码
// //移位运算符不支持浮点数
//	int b=a << 1;
//	printf("%d\n", b);
//	return 0;
//}
//int main()
//{
//	int a = -7;
//	int b = a >> 1;
//	printf("%d\n", b);
//	return 0;
//}
/*
& - 按（二进制）位与,当二进制位同为1时为1
| - 按（二进制）位或，当二进制位有1便为1
^ - 按（二进制）位异或，相同为0，相异为一
*/
//int main() {
//	int a = 3;
//	int b = -5;
//	//int c = a & b;//
//	//int c = a | b;//
//	int c = a ^ b;
//	printf("%d", c);
//	return 0;
//}

//求一个整数在内存中二进制中1的个数
//int main()
//{
//	int a = 3;
//	int i = 0,j=0;
//	for (i = 0; i < 32; i++) {
//		if (a & 1) {
//			j++;
//		}
//		a = a >> 1;
//	}printf("%d\n", j);
//	return 0;
//}


/*
! - 逻辑反操作符 - 0表示假
sizeof - 是一个操作符，计算数组字节大小
~ - 按位（二进制）取反
* - 解引用操作符 
*/
int main() {
	int flag = 3;
	/*if (!flag) {

	}*/
	int a = 0;
	printf("%d\n", ~a);//-1
	return 0;
}